Repository: 84000/data-translation-memory
Catalog: toh159-v3.tmx
Source language: bo
Languages: en

source: །དེ་ནི་གཞོགས་སློང་ཁ་གསག་བྱེད་པ་ཡིན།
en: They attempt to trick and flatter.

source: །དེ་ཡི་སེམས་རྒྱུད་རྟག་ཏུ་གཡན་ཡང་སྤྱོ།
en: “Their mental states are always hateful and discordant.

source: །གཞན་དག་གཏམ་བརྗོད་པ་ནི་ཐོས་ན་ཡང་།
en: Even when they hear others talk,

source: །གཏམ་འདི་བདག་གི་ཕྱིར་ནི་གཏམ་བྱེད་སྙམ།
en: They think the conversation is about them.

source: །དད་པ་མེད་པ་ཁུ་འཕྲིགས་ཟ་བར་འགྱུར།
en: Without faith, they become consumed by doubt.

source: །དེ་ནི་གཞན་གྱི་གཏམ་དག་བརྗོད་བྱས་ནས།
en: “They make comments about others

source: །བདག་ཉིད་མ་དག་དེ་བཞིན་གཞན་ཡང་མཐོང་།
en: And see others as impure as they are themselves.

source: །མ་དད་པ་ནི་རི་དགས་སྐྲག་པ་བཞིན།
en: Without faith, they are like frightened deer—

source: །སུ་ལའང་མི་འབེབས་ཡིད་ཀྱི་རྟོན་མི་བྱེད།
en: They find that no one is reliable or agreeable.

source: །སྦྱོར་བ་ཉམས་ཤིང་གཞན་ཡིད་མི་སྲུང་བ།
en: “Their practice is degenerate and they disregard the feelings of others.

source: །ཚོགས་ཀྱི་ནང་དུ་ཡིད་ཀྱང་ཞུམ་པར་འགྱུར།
en: They become intimidated at gatherings;

source: །ལག་པས་ཚམ་ངམ་བྱེད་ཅིང་འཐབ་པར་བྱེད།
en: With trembling hands, they pick fights,

source: །འོང་བ་དག་ལ་ཚར་ཡང་གཅོད་བྱེད་ཅིང་།
en: And they even put an end to those they come across.

source: །གཞུང་མེད་པར་ནི་འཛུགས་ཤིང་གླེང་བར་བྱེད།
en: “Thus, their assertions and criticisms are unfounded.

source: །ཕྲ་མའི་རང་བཞིན་སྡིག་པ་མང་པོ་ཅན།
en: Slanderous by nature, they are abundantly wicked,

source: །འཐུན་དང་བྲལ་ལ་འཐབ་ཅིང་སྡང་བ་རྣམས།
en: And they are unfriendly, confrontational, and angry.

source: །མ་དད་རང་བཞིན་མཚན་མ་འདི་དག་ཡིན།
en: These are the natural marks of those who are without faith.

source: །དེ་དག་དད་མེད་རབ་ཏུ་བྱུང་ནས་ནི།
en: “After those without faith are ordained,

source: །འདྲེན་པའི་བསྟན་ལ་དེ་དག་སུན་ཡང་འབྱིན།
en: They refute even the teachings of the Guide.

source: །འཐུན་པ་གང་གིས་དགེ་འདུན་མཛེས་འགྱུར་ཏེ།
en: Whenever there is harmony among the Saṅgha,

source: །དེ་དག་ཆོས་མིན་ཚིག་གིས་འགལ་བར་བྱེད།
en: They contradict with words that are not of the Dharma.

source: །རྒྱལ་བ་རྣམས་ཀྱི་བསྟན་ལ་དྲི་མ་དེས།
en: “Since they question the teachings of the conquerors,

source: །མུ་སྟེགས་ཅན་ལྟར་སོམ་ཉི་ཐེ་ཙོམ་བཅས།
en: They are like heretics doubting and hesitating,

source: །དེས་ནི་ཆོས་ལ་གླགས་གཏོང་འགལ་བྱས་ནས།
en: Bringing harm to the Dharma and contradicting it.

source: །དད་མེད་དེ་ནི་ཆོས་ཀྱང་སྤོང་བར་བྱེད།
en: Without faith, they reject even the Dharma.

source: །དེ་ཡི་ལོག་པར་ལྟ་བ་མ་སྤངས་ཏེ།
en: “When they fail to abandon wrong views,

source: །ཕྱི་རོལ་མུ་སྟེགས་ཅན་གྱིས་ནང་དུ་སྨོད།
en: They are condemned to join with non-Buddhist heretics.

source: །དེས་ནི་བསྟན་པ་འདི་ལ་གཏིང་མི་ཚུགས།
en: They are not rooted in the teachings

source: །ཆོས་གོས་འཆང་བ་ཙམ་གྱིས་དགེ་སློང་བརྗོད།
en: And are called monks merely because they wear Dharma robes.

source: །བདག་མེད་རྡོ་རྗེ་ཤིན་ཏུ་སྒོམ་པ་དེས།
en: “By deeply cultivating immutable selflessness,

source: །འཇིག་ཚོགས་ལྟ་བ་འདི་དང་བྲལ་བ་ཡི།
en: A monk free of the view of the transitory collection

source: །དགེ་སློང་དེ་ནི་བསྟན་འདིར་ཡེ་ཤེས་ལ།
en: Will experience the wisdom of the teachings

source: །སྤྱོད་ཡུལ་རླུང་ལྟར་འདུས་བྱས་ཆགས་པ་མེད།
en: And like the wind will not be attached to compounded things.

source: །དད་པ་མེད་པ་ལས་ལ་ཡིད་མི་ཆེས།
en: “Without faith, they are not convinced of karma.

source: །སྡིག་པའི་སེམས་ཀྱི་དབང་དུ་སོང་ནས་ནི།
en: Falling under the power of wicked thoughts, They will soon reside in the lower realms,

source: །དེ་ནི་ཇི་ལྟར་གཞན་ལ་གཙེས་པ་བཞིན། །རིང་པོར་མི་ཐོགས་ངན་སོང་གནས་པར་འགྱུར།
en: Tormented just as they tormented others.

source: །རྒྱ་མཚོ་ཆེ་ལ་ཇི་ལྟར་ཆུ་གནས་བཞིན།
en: “Just as water constitutes the great ocean,

source: །བསྟན་པ་འདི་ལ་དད་པ་གཞི་ཡིན་ཏེ།
en: Faith in this teaching is the basis.

source: །གང་ཟག་གང་ཞིག་བསྟན་ལ་མ་དད་དེ།
en: As for anyone who does not have faith in the teachings,

source: །ང་ཡི་མ་ཡིན་ང་ཡང་དེའི་མ་ཡིན།
en: I am not for them, and they are not for me.

source: །བགྲོད་པ་ཕུན་སུམ་ཚོགས་གཞི་དད་པ་ཡིན།
en: “Faith is the basis for this wondrous journey.

source: །བདུད་རྩི་ཐོབ་པའི་ལམ་དང་སྣང་བ་ཡིན།
en: It is the path and light that lead to the elixir.

source: །ཅི་ལྟར་འཛམ་བུ་གླིང་པའི་རྒྱལ་པོ་བཞིན།
en: Just like the king of Jambudvīpa,

source: །འདི་ནི་ཡོན་ཏན་ཀུན་གྱི་ཐོག་མར་འགྲོ།
en: It is the foremost of all qualities.

source: །རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱི་གཙུག་ལག་ཁང་གི་དགེ་སློང་དེ་དག་ནི་ཡོན་ཏན་དེ་ལྟ་བུ་དེ་དག་དང་མི་ལྡན་པས་ན་དེའི་ཕྱིར་དེར་བྱང་ཆུབ་སེམས་དཔའ་མཐོང་བ་དོན་ཡོད་ཀྱིས་སོ་སོར་བརྟགས་ནས་མ་འདུག་པར་མྱུར་བ་ཁོ་ནར་སོང་ངོ་།
en: “Great King, the monks in your monastery lacked qualities such as these. Therefore, the bodhisattva Amoghadarśin examined them individually and did not stay but quickly departed.

source: །རྒྱལ་པོ་ཆེན་པོ་དགེ་སློང་དྲུག་ཅུ་པོ་དེ་དག་ཐམས་ཅད་ནི་དེ་ནས་ཤི་འཕོས་ནས་བསྐལ་པ་གསུམ་གྱི་བར་དུ་ངན་སོང་རྣམས་སུ་འཁོར་འཁོར་ནས་ཚེ་རབས་བརྒྱད་ཁྲིའི་བར་དུ་རིགས་ངན་དུ་སྐྱེ་བར་འགྱུར་ཏེ།
en: “Great King, after they die and pass on, all of those sixty monks will circle in the lower realms for three eons. Thereafter, they will be born into low classes of beings for eighty thousand lives;

source: དམན་པ་དང་། གཞན་གྱི་ཟས་ཀྱིས་འཚོ་བ་དང་། འཇིག་རྟེན་གྱིས་སྨད་པར་འགྱུར་བ་དང་། ལུས་རིད་པ་དང་། མདོག་ངན་པ་དང་ཆུང་བར་གྲགས་པ་དང་། བྱད་ངན་པ་དང་། ཚེ་རབས་ཐམས་ཅད་དུ་ཤས་ཆེར་ནད་རྒྱུན་རིང་དང་། ཁམས་མ་སྙོམས་ཏེ་འཁྲུག་པ་དང་། ཉམ་ཐག་པའི་སྐད་ཀྱིས་ཆོ་ངེ་འདོན་པ་དང་། གཤིས་ངན་དུ་འཆི་བར་འགྱུར་རོ།
en: they will be inferior, survive on leftover food, and be reviled by the world. They will have emaciated bodies, be of hideous complexion, be considered insignificant, be disfigured, and be afflicted with chronic ailments in almost all successive lifetimes. They will be agitated due to imbalanced health, wail with pitiful voices, and die in a bad state.

source: །དེ་ནས་ཚེ་རབས་ཀྱི་ཐ་མ་ལས་ཤི་འཕོས་ནས་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར་ཏེ།
en: “Then, after dying in their last lifetime, they will be reborn in the realm of Sukhāvatī.

source: ལོ་བརྒྱད་ཁྲིའི་བར་དུ་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་ཚེ་དཔག་མེད་ཆོས་སྟོན་པར་ཐོས་ལ་ཤེས་པར་ནི་མི་འགྱུར་རོ།
en: For eighty thousand years they will hear but not understand the teachings of the thus-gone Amitāyus.

source: །དེ་བཞིན་གཤེགས་པ་དེའི་འོད་མཐོང་ལ་དེ་བཞིན་གཤེགས་པ་དེ་ནི་མི་མཐོང་ངོ་།
en: They will be able to see that thus-gone one’s light but not him;

source: །དེ་དག་གི་ལུས་ལ་འོད་ཀྱིས་ཕོག་པར་ཡང་མི་འགྱུར་རོ།
en: his light will not even shine on their bodies.

source: །དེ་དག་གིས་གཏན་དུ་རྣམ་པར་དག་པར་བྱ་བའི་ཕྱིར་ཉིན་ལན་གསུམ་མཚན་ལན་གསུམ་དུ་བྱང་ཆུབ་སེམས་དཔའ་འདུས་པ་ལ་ཡན་ལག་ལྔས་གཏུགས་ཏེ།
en: In order to purify their faults completely, they will confess their faults to the gathering of bodhisattvas three times a day and three times a night, with their limbs and heads touching the ground.

source: ཉེས་པ་བཤགས་ནས་གདོད་དེའི་འོག་ཏུ་ལས་དེ་རྣམ་པར་དག་པར་འགྱུར་རོ།
en: Only then will their actions become completely purified.

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་ཡང་མཐོང་། ཆོས་ཀྱང་ཤེས་པར་འགྱུར་ལ། བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་ཡང་ཐོབ་པར་འགྱུར་རོ།
en: Thereafter, they will be able to see the Thus-Gone One, understand the teachings, and receive predictions regarding their awakening.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དགེ་སློང་དེ་དག་བསལ་དུ་སྩལ་བར་བགྱིའོ།
en: Then King Brahmadatta said to the Blessed One, “Blessed One, give me your permission to remove these monks.

source: །དགེ་སློང་སྡིག་ཅན་དེ་ལྟ་བུ་དག་ཆགས་འོག་ཐམས་ཅད་དུ་གྲགས་པ་ཡང་མི་སྤྲོ་ན། མཐོང་བ་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ། དེ་ནས་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་ཞོ་ཤས་འཚོ་བ་དག་བཏང་སྟེ། དགེ་སློང་དེ་དག་བསལ་དུ་བཅུག་ནས་ཆགས་འོག་ཐམས་ཅད་དུ་དེ་དག་མི་འདུག་པར་བྱས་སོ།
en: I do not wish for such wicked monks to be known among my subjects, let alone be seen.” Then King Brahmadatta dispatched his men in order to remove those monks, ensuring that they did not remain among his subjects.

source: །བཅོམ་ལྡན་འདས་འདི་ནི་དེ་དག་གི་ཚེ་འདིའི་རྣམ་པར་སྨིན་པ་ལགས་སོ།
en: “Blessed One, this is the fruition of their karma in this life.

source: །དེ་དག་ནི་ཚེ་ཕྱི་མ་ལ་ཡང་བདག་ཉིད་ཀྱིས་བདག་ཉིད་བརྡེགས་པ་ལགས་སོ།
en: These are people who will harm themselves in future lives as well.”

source: །དེ་སྐད་ཅེས་གསོལ་པ་དང་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་ཚངས་པས་བྱིན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་འདི་དག་ནི་བསྟན་པ་འདི་ལ་རབ་ཏུ་བྱུང་བའི་གཡང་ས་ཡིན་ཏེ།
en: As he said this, the Blessed One said to King Brahmadatta, “Great King, there are four pitfalls for those who have gone forth into this teaching of mine.

source: སངས་རྒྱས་ལ་མ་གུས་པ་དང་། དམ་པའི་ཆོས་སྤོང་བ་དང་། ཆོས་སྨྲ་བ་ལ་སྡང་བ་དང་། མངོན་པར་བརྩོན་པ་མེད་པར་དད་པས་བྱིན་པ་ལེན་པ་སྟེ།
en: They are as follows: (1) not respecting the Buddha, ( ) forsaking the supreme Dharma, (3) loathing those who teach the Dharma, and (4) taking offerings given with faith when one lacks true effort.

source: རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་དེ་དག་ནི་བསྟན་པ་འདི་ལ་རབ་ཏུ་བྱུང་བའི་གཡང་ས་ཡིན་ནོ།
en: “Great King, these are the four pitfalls for those who have gone forth into this teaching of mine.”

source: །སངས་རྒྱས་སོམ་ཉི་ཟ་བ་གཡང་སའི་མཆོག །འཇིག་རྟེན་ཀུན་གྱིས་སྐྱབས་བྱེད་མི་ནུས་ཏེ།
en: The whole word cannot protect such a person.

source: །བློ་ཆུང་དེ་ནི་བསྟན་ལས་ཉམས་གྱུར་པས།
en: Such a narrow-minded person turns from the teacher,

source: །མགོན་མེད་དེ་ནི་ངན་འགྲོར་འགྲོ་བར་འགྱུར།
en: And without a protector will migrate to the lower realms.

source: །དེས་ནི་ཆོས་ཀྱང་སྤངས་པས་ངན་སོང་འགྲོ།
en: “Forsaking the Dharma, they migrate to a lower existence.

source: །ལོ་ནི་སྟོང་ལས་མི་ཉུང་བར་དུ་ཡང་།
en: For a period of no less than a thousand years,

source: །དམུས་ལོང་དབང་པོ་དམན་ཞིང་སེམས་ཀྱང་ཉམས།
en: They will be blind, with dull senses and a degenerate mind.

source: །སྡུག་བསྔལ་ཆེན་པོ་འདི་ནི་གཡང་ས་གཉིས།
en: This great suffering is the second pitfall.

source: །སངས་རྒྱས་ཆོས་འཛིན་མི་འཇིགས་གང་ཡིན་པ།
en: “To deprecate those who are fearless in upholding the Buddha's teachings,

source: །ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་སྐྱོང་བྱེད་པ།
en: And who sustain the wisdom of omniscience,

source: །དེ་དག་སྐུར་འདེབས་གཡང་ས་ཆེན་པོ་གསུམ།
en: Is the third great pitfall;

source: །བསྐལ་པ་བྱེ་བ་མང་པོར་མྱོང་བར་འགྱུར།
en: It is experienced for many tens of millions of eons.

source: །དེ་ནི་དད་པས་བྱིན་པ་མི་རིགས་སྤྱོད།
en: “Those who misuse offerings given by the faithful,

source: །དེ་ནི་གཡང་ས་ཆེན་པོ་བཞི་པ་ཡིན།
en: Which is the fourth great pitfall,

source: །དེ་ནི་འཇིག་རྟེན་སུས་ཀྱང་སྐྱབས་མི་ནུས།
en: Will be impossible to protect, even by the entire world.

source: །སྡིག་པའི་ལས་ཅན་ངན་སོང་ཀུན་ཏུ་རྒྱུག །བསམ་པ་དག་པ་འཕགས་པའི་དག་པ་ཡིན།
en: Possessing bad karma, they will wander through all lower existences. “The purity of thoughts is the purity of the noble ones.

source: །བྱང་ཆུབ་གཡོ་མེད་དེ་ནི་སེམས་ཀྱི་གཞི།
en: Not wavering from awakening, that is the basis of the mind.

source: །སྨྲས་པ་ཙམ་གྱིས་བྱང་ཆུབ་མི་འཐོབ་ཀྱི།
en: One cannot attain awakening through mere words.

source: །སེམས་ཀྱང་དག་པར་བྱ་ཞེས་བདེ་གཤེགས་གསུངས།
en: One must also purify the mind—this is taught by the Thus-Gone One.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན་སྲོག་ཆགས་ལྔ་སྟོང་གིས་སྔོན་མ་བསྐྱེད་པ་ལས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ་མི་སྐྱེ་བའི་ཆོས་རྣམས་ལ་ཡང་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ་རྒྱལ་པོ་ཚངས་པས་བྱིན་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ།
en: When the Blessed One spoke this discourse of the Dharma, five thousand beings generated the aspiration for unsurpassed, perfect, and complete awakening, which they had never done before, and achieved the acceptance of phenomena as unarisen. King Brahmadatta also became irreversibly oriented toward unsurpassed, perfect, and complete awakening.

source: །སྲོག་ཆགས་འབུམ་ནི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་རྣམ་པར་དག་གོ། །ལྷ་དུང་ཕྱུར་གྱིས་ནི་སྔོན་མ་བསྐྱེད་པ་ལས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ།
en: One hundred thousand beings possessed the pure eye of the Dharma, which is devoid of stains and free from defilements with respect to phenomena. One hundred million gods generated the mind of awakening, which they had never done before.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་འཛུམ་པ་མཛད་དོ། །འདི་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཆོས་ཉིད་དེ་གང་གི་ཚེ་འཛུམ་པ་མཛད་པ་དེའི་མོད་ལ། བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་གྱི་སྒོ་ནས་འོད་ཟེར་ཁ་དོག་དུ་མ་ཁ་དོག་སྣ་ཚོགས་པ་འདི་ལྟ་སྟེ། སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། བཙོད་ཀ་དང་། ཤེལ་གྱི་ཁ་དོག་དང་། དངུལ་གྱི་ཁ་དོག་ལྟ་བུ་དག་བྱུང་སྟེ།
en: The Blessed One then smiled, and as happens whenever the blessed ones smile, at that moment light of myriad colors—blue, yellow, red, white, crimson, crystalline, and silver—emerged from his mouth.

source: དེ་དག་གིས་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་སྣང་བས་ཁྱབ་པར་བྱས་ནས་སྟེང་དུ་ཡང་ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་སོང་སྟེ།
en: The light illuminated boundless, limitless realms and reached all the way up to the world of Brahmā.

source: ཉི་མ་དང་ཟླ་བ་རྣམས་ཀྱི་གཟི་བརྗིད་ཀྱང་མེད་པར་བྱས་ནས་ཕྱིར་ལོག་སྟེ།
en: It even eclipsed the magnificence of the sun and moon.

source: བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱི་བོའི་གཙུག་ཏུ་མི་སྣང་བར་གྱུར་ཏོ།
en: Then the light rays returned, circled around the Blessed One three times, and dissolved into the crown of his head.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཐོང་བ་དོན་ཡོད་ཀྱིས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འཛུམ་པ་མཛད་པའི་རྒྱུ་གང་ལགས།
en: Then the bodhisattva Amoghadarśin folded his hands and bowed in the direction of the Blessed One and asked him, “Blessed One, what are the causes of your smile?

source: རྐྱེན་གང་ལགས།
en: What are the conditions?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མཐོང་བ་དོན་ཡོད་རྒྱལ་པོ་ཚངས་པས་བྱིན་འདི་ནི་བསྐལ་པ་སུམ་ཅུའི་བར་དུ་ལོག་པར་ལྟུང་བར་མི་འགྱུར་ཏེ། ལྷ་དང་མིའི་ཕུན་སུམ་ཚོགས་པ་མྱོང་ནས་སངས་རྒྱས་དུང་ཕྱུར་ཕྲག་བརྒྱད་མཉེས་པར་བྱེད་པར་འགྱུར་རོ།
en: The Blessed One said, “Amoghadarśin, King Brahmadatta will not fall into any bad state for thirty eons, and after enjoying the bounties of the gods and humans, he will please eight hundred million buddhas.

source: །ཐམས་ཅད་དུ་ཡང་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར་ཏེ།
en: In all his lives, he will be universal emperor.

source: གླིང་བཞི་ཡོངས་སུ་བཏང་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་ལ་ཞེ་འགྲས་པ་མེད་པའི་སེམས་ཀྱིས་དགོངས་པ་བཞིན་དུ་བསྙེན་བཀུར་བྱེད་པར་འགྱུར་རོ།
en: Forsaking the four continents completely, he will respect and revere the blessed buddhas with an intention free of any hostility.

source: །དེ་དེའི་འོག་ཏུ་བདེ་བ་ཅན་གྱི་བཀོད་པ་དང་འདྲ་བའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བཀོད་པ་དཔག་ཏུ་མེད་པའི་རྒྱལ་པོ་ཞེས་བྱ་བར་འགྱུར་རོ།
en: “Thereafter, he will actually attain buddhahood—unsurpassed, perfect, and complete awakening—in a buddha field that will be equal in display to Sukhāvatī, and he will become a thus-gone, worthy, perfect buddha called King of Limitless Display.”

source: །དེ་ནས་རྒྱལ་པོ་ཚངས་པས་བྱིན་ཚིམ་ཞིང་མགུ་ལ་ཡིད་རངས་ཏེ། རབ་ཏུ་དགའ་ཞིང་དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ཏེ།
en: Thus, King Brahmadatta felt contented, elated, jubilant, and overjoyed.

source: བྱང་ཆུབ་སེམས་དཔའ་མཐོང་བ་དོན་ཡོད་ཀྱི་རྐང་པ་ལ་ཡན་ལག་ལྔས་གཏུགས་ནས།
en: Happy and blissful, he bowed down with the five points of his body at the feet of the bodhisattva Amoghadarśin.

source: བཅོམ་ལྡན་འདས་མཐོང་བ་དོན་ཡོད་ལ་གང་གི་ཕྱིར་བདག་གི་སླད་དུ་དགེ་སློང་གི་དགེ་འདུན་དེ་དག་དང་ལྷན་ཅིག་འོབ་རྒྱལ་ཅིང་བཞུགས་པར་གྱུར་པ་བདག་གིས་ལྷག་པའི་བསམ་པས་བཟོད་པ་གསོལ་ལོ་ཞེས་བྱས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་མཐོང་བ་དོན་ཡོད་ཀྱིས་ཀྱང་རྒྱལ་པོ་ཚངས་པས་བྱིན་ལ་སྙིང་བརྩེ་བའི་ཕྱིར་བཟོད་པར་བྱས་སོ།
en: He then said, “Blessed One, because Amoghadarśin endured being with that community of monks for my sake, I sincerely appeal to him for forgiveness.” Out of his love for King Brahmadatta, the bodhisattva Amoghadarśin then forgave him.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། རྒྱལ་པོ་ཚངས་པས་བྱིན་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།
en: When the Blessed One spoke thus, King Brahmadatta, and the world with its gods, humans, asuras, and gandharvas all rejoiced and praised the words of the Blessed One.

source: །འཕགས་པ་ཚངས་པས་བྱིན་གྱིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།།
en: Here ends the noble Mahāyāna sūtra “The Questions of Brahmadatta.”

source: །།རྒྱ་གར་གྱི་མཁན་པོ་སུ་རེནྡྲ་བོ་དྷི་དང་། པྲཛྙཱ་བརྨ་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བནྡེ་ཡེ་ཤེས་སྡེ་ལ་སོགས་པས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།།
en: Colophon It was translated, edited, and finalized by the Indian preceptors Surendrabodhi and Prajñāvarman, as well as the editor and translator Bandé Yeshé Dé and others.
